[
  {
    "image": "assets/images/MLBTheShow251x1.jpg",
    "youtubeEmbed": "https://www.youtube.com/embed/DdbcF6TCAXM",
    "title": "PlayStation Studios - MLB The Show 25",
    "caption": "Credits: Game Test Analyst<br />At Sony Interactive Entertainment, I conducted comprehensive testing on this title, identifying and documenting a variety of bugs with from gameplay, UI, performance, and animation bugs. I collaborated with developers and designers to provide feedback on mechanics and usability of the game. As well as having developed automated test scripts using in-house tools and Java to streamline game testing efficiency. This especially came in handy for testing new content updates and patches to ensure it had a smooth integration with the existing game. All of this to contribute a smooth user experience to the players.",
    "buttonText": "Learn more",
    "buttonLink": "https://theshow.com/"
  },
  {
    "image": "/assets/images/sonicrumble.jpg",
    "youtubeEmbed": "https://www.youtube.com/embed/Em6-SjjaYQE",
    "title": "SEGA - Sonic Rumble",
    "caption": "Credits: Playtester<br />Through SEGA's SEGA Insights program, I playtested various game features, identifying and documenting bugs, glitches, and inconsistencies for a project to ensure a smooth, fun experience for the player. I collaborated with other team members to consolidate feedback for the QA/focus group facilitator, and pointed out both flaws and strengths of the content given to allow a nuanced discussion of the material.",
    "buttonText": "Learn more",
    "buttonLink": "https://sonicrumble.sega.com/"
  },
  {
    "image": null,
    "youtubeEmbed": "https://www.youtube.com/embed/46lLV84CdXY",
    "title": "Gizmos Gambit",
    "caption": "Credits: UI Design/QA Tester<br />Through the use of Trello for management, Discord for communication and GitHub for the latest builds, I worked with my group for Gamedev.tv's Game Jam 2022 remotely to develop and QA test a top-down shoot-em-up game.",
    "buttonText": "Learn more",
    "buttonLink": "https://somedumbfox.itch.io/gizmos-gambit",
    "inner": true
  },
  {
    "image": "/assets/images/SEGA_logo.png",
    "youtubeEmbed": null,
    "title": "SEGA - Title Not Announced",
    "caption": "Credits: Playtester<br />Further information cannot be disclosed due to signed NDA.",
    "buttonText": "Coming Soon!",
    "buttonLink": null
  },
  {
    "buttonText": "Back to Home",
    "buttonLink": "/index.html",
    "target": "_self",
    "inner": true
  }
]